PinkFluffyUnic0rn/stm32flight/main.c
#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

#include "main.h"
#include "device.h"
#include "util.h"
#include "icm42688.h"
#include "hp206c.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "dsp.h"
#include "crsf.h"
#include "w25.h"
#include "m10.h"
#include "uartconf.h"

// Max length for info packet
// sent back to operator
#define INFOLEN 512

// device numbers
#define ICM_DEV		0
#define HP_DEV		1
#define QMC_DEV		2
#define CRSF_DEV	3
#define M10_DEV		4
#define ESP_DEV		5
#define UART_DEV	6
#define DEV_COUNT	7

// timers prescaler
#define PRESCALER 128

// clock frequency
#define OCSFREQ 128000000

// period for main timer (used to timing periodic events)
#define TIMPERIOD 0xfff

// main timer ticks per second
#define TICKSPERSEC (OCSFREQ / PRESCALER)

// PWM settings
#define PWM_MAXCOUNT 3200

// Periodic events frequencies
#define PID_FREQ 4000
#define CHECK_FREQ 1
#define CALIB_FREQ 25
#define HP_FREQ 25
#define QMC_FREQ 100
#define TELE_FREQ 10
#define LOG_FREQ 64

// MCU flash address where quadcopter settings is stored
#define USER_FLASH 0x080e0000

// quadcopter setting's slot
#define USER_SETSLOTS (0x80 / sizeof(struct settings))

// maximum telemetry packets count, depends on onboard flash size
#define LOG_MAXPACKS \
	(W25_TOTALSIZE / sizeof(struct logpack))

// log packets buffer size
#define LOG_BUFSIZE (W25_PAGESIZE / sizeof(struct logpack))

// log packet values positions
#define LOG_PACKSIZE	16
#define LOG_ACC_X	0
#define LOG_ACC_Y	1
#define LOG_ACC_Z	2
#define LOG_GYRO_X	3
#define LOG_GYRO_Y	4
#define LOG_GYRO_Z	5
#define LOG_MAG_X	6
#define LOG_MAG_Y	7
#define LOG_MAG_Z	8
#define LOG_BAR_TEMP	9
#define LOG_BAR_ALT	10
#define LOG_ROLL	11
#define LOG_PITCH	12
#define LOG_YAW		13
#define LOG_CLIMBRATE	14
#define LOG_ALT		15

// debug commands maximum count
#define MAX_COMMANDS 32

// debug commands maximum token count
#define MAX_CMDTOKS 12

// Timer events IDs
#define TEV_PID 	0
#define TEV_CHECK 	1
#define TEV_CALIB	2
#define TEV_HP		3
#define TEV_QMC		4
#define TEV_LOG		5
#define TEV_TELE	6
#define TEV_COUNT	7

// Debug connection port
#define SERVPORT 8880

// Timeout in seconds before quadcopter disarm
// when got no data from ERLS receiver
#define ELRS_TIMEOUT 2

// check if enough time passed to call periodic event again.
// ev -- periodic event's context.
#define checktimev(ev) ((ev)->ms > (TICKSPERSEC / (ev)->freq - (ev)->rem))

// update periodic event's counter.
// ev -- periodic event's context.
// s -- time in microseconds after last callback's call.
#define updatetimev(ev, s) (ev)->ms += (s);

// set value in current log frame
// pos -- value's position inside the frame
// val -- value itself
#define logwrite(pos, val) logbuf[logbufpos].data[(pos)] = (val);

enum ALTMODE {
	ALTMODE_ACCEL	= 0,
	ALTMODE_SPEED	= 1,
	ALTMODE_POS	= 2
};

enum GNSSSTATUS {
	GNSSSTATUS_VALID = 0,
	GNSSSTATUS_INVALID = 1
};

enum LATDIR {
	LATDIR_N = 0,
	LATDIR_S = 1
};

enum LONDIR {
	LONDIR_E = 0,
	LONDIR_W = 1
};

enum MAGVARDIR {
	MAGVARDIR_E = 0,
	MAGVARDIR_W = 1
};

// Quadcopter settings structure stored in MCU's flash
struct settings {
	float mx0, my0, mz0;	// magnetometer offset values for X, Y
				// and Z axes determinted by
				// calibration procedure

	float mxsc, mysc, mzsc;	// megnetormeter scaling values for Z,
				// Y and Z axes determinted by 
				// calibration procedure

	float magdecl;		// magnetic declination

	float ax0, ay0, az0;	// accelometer offset values for X, Y
				// and Z axes

	float gx0, gy0, gz0;	// gyroscope offset values for X, Y
				// and Z axes

	float rsc, psc;		// motor thrust scaling for roll and
				// pitch side motors, because not all
				// motors are abolutely equal

	float roll0, pitch0, yaw0; // roll, pitch and yaw offset values

	float rollmax, pitchmax; // maximum roll and pitch angles in Pi

	float yawspeed;		// yaw rotation speed in Pi for
				// single loop yaw mode
	float yawtargetspeed;	// yaw target change speed in Pi for
				// dual loop yaw mode
	float accelmax;		// maximum acceleration in g for
				// single loop throttle mode
	float climbratemax;	// maximum climbrate in m/s for
				// dual loop throttle mode
	float altmax;		// maximum altitude in m for triple
				// loop mode (altitude hold mode)

	float atctcoef;		// time coefficient for pitch/roll
				// complimentary filter
	float yctcoef;		// time coefficient for yaw
				// complimentary filter
	float ttcoef;		// time coefficient for vertical axis
				// acceleration pow-pass filter
	float vatcoef;		// time coefficient for vertical
				// acceleration pow-pass filter
	float atcoef;		// time coefficient for altitude
				// low-pass filter
	float cctcoef;		// time coefficient for climb rate
				// complimentary filter
	float actcoef;		// time coefficient for altitude
				// complimentary filter

	int speedpid;	// 1 if single PID loop for roll/pitch is used,
			// 0 if double loop is used

	int yawspeedpid; // 1 if single PID loop for yaw is used, 0 if
			 // double loop is used

	float p, i, d;	// P/I/D values for roll/pitch (used only in
			// double roll/pitch PID loop mode)

	float sp, si, sd;	// P/I/D values for roll/pitch
				// rotation speed

	float yp, yi, yd; // P/I/D values for yaw (used only in double
			  // yaw PID loop mode)

	float ysp, ysi, ysd;	// P/I/D values for yaw rotation speed

	float zsp, zsi,	zsd; // P/I/D values for vertical acceleration
	float cp, ci, cd; // P/I/D values for climb rate
	float ap, ai, ad; // P/I/D values for altitude
};

// Values got from GNSS module using NMEA protocol
struct gnss_data {
	enum GNSSSTATUS status;		// GNSS data status
					// 1 if valid, 0 otherwise
	
	float time;			// seconds passed from 00:00 UTC
	char date[10];			// date in format dd.mm.yy
	
	uint8_t lat;			// latitude
	float latmin;			// latitude minutes
	enum LATDIR latdir;		// latitude direction, 1 if
					// south, 0 if north

	uint8_t lon;			// longitude
	float lonmin;			// longitude minutes
	enum LONDIR londir;		// longitude direction, 1 if
					// west, 0 if east

	float magvar;			// magnetic declination in
					// degrees
	enum MAGVARDIR  magvardir;	// magnetic declination
					// direction, 0 if east, 1 if
					// west

	float speed;			// speed in knots
	float course;			// course toward north pole
					// in degrees
	float altitude;			// altitude in meters

	int quality;			// link quality
	uint8_t satellites;		// satellites count
};

