PinkFluffyUnic0rn/stm32flight/main.c
// telemetry packet stored in onboard flash
struct logpack {
	float data[LOG_PACKSIZE];
};


// debug command handler structure
struct command {
	const char *name;
	int (*func)(const struct cdevice*, const char **, char *);
};

// Periodic event's context that holds event's settings
// and data needed beetween calls
struct timev {
	int ms;			// microseconds passed from
				// last triggering
	int rem;
	int freq;		// event frequency
	int (*cb)(int);		// event callback
};

// STM32 clocks and periphery devices initilization
void systemclock_config();
static void gpio_init();
static void i2c_init();
static void spi1_init();
static void spi2_init();
static void dma_init();
static void tim1_init();
static void tim8_init();
static void adc1_init(void);
static void usart1_init();
static void usart2_init();
static void usart3_init();
static void uart4_init();

// Init ESC's
static void esc_init();

// Init HP206c barometer
static void hp_init();

// Init ICM-42688-P IMU
static void icm_init();

// Init QMC5883L magnetometer
static void qmc_init();

// Init ESP07
static void espdev_init();

// Init ERLS receiver driver
static void crsfdev_init();

// Init W25Q onboard flash memory
static void w25dev_init();

// Init GNSS module
static void m10dev_init();

// Init UART config connection
static void uartdev_init();

// STM32 perithery contexts
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;
I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;
TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim8;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
UART_HandleTypeDef huart4;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart3_rx;
DMA_HandleTypeDef hdma_uart4_rx;

// Flight controller board's devices drivers
struct cdevice dev[DEV_COUNT];
struct bdevice flashdev;

// DSP contexts
struct dsp_lpf valpf;
struct dsp_lpf tlpf;
struct dsp_lpf altlpf;

struct dsp_compl pitchcompl;
struct dsp_compl rollcompl;
struct dsp_compl yawcompl;

struct dsp_compl climbratecompl;
struct dsp_compl altcompl;

struct dsp_pidval pitchpv;
struct dsp_pidval rollpv;
struct dsp_pidval pitchspv;
struct dsp_pidval rollspv;
struct dsp_pidval yawpv;
struct dsp_pidval yawspv;
struct dsp_pidval tpv;
struct dsp_pidval cpv;
struct dsp_pidval apv;

// Global storage for sensor data
// that aquired in separate events
float temp;

struct qmc_data qmcdata;

struct gnss_data  gnss;

struct crsf_tele tele;

// Control values
float thrust = 0.0; // motors basic thrust
float rolltarget = 0.0; // roll PID target
float pitchtarget = 0.0; // pitch PID target
float yawtarget = 0.0; // yaw PID target
float ltm = 1.0; // left-top motor thrust scaling
float lbm = 1.0; // left-bot motor thrust scaling
float rtm = 1.0; // right-top motor thrust scaling
float rbm = 1.0; // right-bot motor thrust scaling
float en = 0.0; // 1.0 when motors turned on, 0.0 otherwise
enum ALTMODE altmode = 0; // ALTMODE_POS if in altitude hold mode,
			  // ALTMODE_SPEED if climbrate control mode,
			  // ALTMODE_ACCEL if acceleration control mode
int yawspeedpid = 0;	// 1 if only gyroscope if used for yaw
			// stabilization, 0 if magnetometer is used

int magcalibmode = 0; // 1 when magnetometer calibration mode
		      // is enabled, 0 otherwise
int elrs = 0; // 1 when ELRS control is active (ELRS remote's channel 8
	      // is > 50)

// Pressure and altitude initial values
float alt0;

// Settings
struct settings st;

// Timer events
struct timev evs[TEV_COUNT];

// Stabilization loops counter
int loops = 0;

// Stabilization loops performed in last second
int loopscount = 0;

// Timeout counter for the ELRS reciver. Set to ELRS_TIMEOUT after
// receiving useful packet from receiver and decreased by 1 every
// second. If it falls to 0, quadcopter disarms.
int elrstimeout = ELRS_TIMEOUT;

// Log bufferization controlling variables
int logtotal = 0;
int logbufpos = 0;
int logflashpos = 0;
size_t logsize = 0;
struct logpack logbuf[LOG_BUFSIZE];

// Debug commands handlers
struct command commtable[MAX_COMMANDS];
size_t commcount;

// Add debug command with it's handler.
//
// name -- command name
// func -- command handler
int addcommand(const char *name,
	int (*func)(const struct cdevice *, const char **, char *))
{
	commtable[commcount].name = name;
	commtable[commcount].func = func;

	++commcount;

	return 0;
}

// Get value from ADC, was used to monitor battery voltage.
//
// hadc -- ADC context.
uint32_t getadcv(ADC_HandleTypeDef *hadc)
{
	uint32_t v;

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return v;
}

// external interrupt callback. It calls interrupt hadlers from
// drivers for devices that use external interrupts.
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(dev[ESP_DEV].status))
		dev[ESP_DEV].interrupt(dev[ESP_DEV].priv, &pin);
}

// UART receive callback. It calls interrupt handlers from
// drivers for devices working through UART.
//
// huart -- context for UART triggered that callback.
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) 
{
	if (DEVITENABLED(dev[M10_DEV].status))
		dev[M10_DEV].interrupt(dev[M10_DEV].priv, huart);
	
	if (DEVITENABLED(dev[CRSF_DEV].status))
		dev[CRSF_DEV].interrupt(dev[CRSF_DEV].priv, huart);

	if (DEVITENABLED(dev[UART_DEV].status))
		dev[UART_DEV].interrupt(dev[UART_DEV].priv, huart);
}

// UART error callback. Calls UART error handlers from
// drivers for devices working through UART.
//
// huart -- context for UART triggered that callback.
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[ESP_DEV].status))
		dev[ESP_DEV].error(dev[ESP_DEV].priv, huart);
}

// Initilize periodic event's context
//
// ev -- periodic event's context.
// freq -- periodic event's frequency in Hz (calls per second).
// cb -- callback that is called by this event.
int inittimev(struct timev *ev, int freq, int (*cb)(int))
{
	ev->ms = 0;
	ev->rem = 0;
	ev->freq = freq;
	ev->cb = cb;

