PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

// reset periodic event's counter. Used after every
// event's callback call.
// ev -- periodic event's context.
int resettimev(struct timev *ev)
{
	ev->rem += ev->ms - TICKSPERSEC / (ev)->freq;
	ev->ms = 0;

	return 0;
}

// calculate tilt compensated heading direction using magnetometer
// readings, roll value and pitch value.
// 
// r -- roll value.
// p -- pitch value.
// x -- magnetometer's X axis value.
// y -- magnetometer's Y axis value.
// z -- magnetometer's Z axis value.
float qmc_heading(float r, float p, float x, float y, float z)
{
	x = st.mxsc * (x + st.mx0);
	y = st.mysc * (y + st.my0);
	z = st.mzsc * (z + st.mz0);

	x = x * cosf(p) + y * sinf(r) * sinf(p)
		- z * cosf(r) * sinf(p);
	y = y * cosf(r) + z * sinf(r);

	return circf(atan2f(y, x) + st.magdecl);
}

/* Set motors thrust

      ltd    rtd
        \    /
   ^     \  /
   |       
   p     /  \
        /    \
      lbd    rbd
        
         <- r
*/
// all values should be between 0.0 and 1.0.
int setthrust(float ltd, float lbd, float rbd, float rtd)
{
	if (isnan(ltd) || isnan(rtd) || isnan(rbd)
		|| isnan(lbd) || !elrs)
		ltd = rtd = rbd = lbd = 0.0;

	TIM1->CCR1 = (uint16_t) ((trimuf(ltd) * 0.8 + 0.19)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR2 = (uint16_t) ((trimuf(lbd) * 0.8 + 0.19)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR3 = (uint16_t) ((trimuf(rtd) * 0.8 + 0.19)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR4 = (uint16_t) ((trimuf(rbd) * 0.8 + 0.19)
		* (float) PWM_MAXCOUNT);

	return 0;
}

// write quadcopter settings into internal MCU flash
//
// slot -- offset in settings array in flash.
int writesettings(int slot)
{
	uint32_t sz;
	uint32_t *pt;
	uint32_t addr;
	int j;

	__disable_irq();
	HAL_FLASH_Unlock();

	FLASH_Erase_Sector(FLASH_SECTOR_11,  VOLTAGE_RANGE_3);

	sz = sizeof(struct settings);
	pt = (uint32_t *) &st;

	addr = USER_FLASH + sizeof(struct settings) * slot;
	for (j = 0; j < sz / 4; ++j) {
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, pt[j]);
		addr += 4;
	}

	HAL_FLASH_Lock();
	__enable_irq();

	return 0;
}

// Read setting from internal MCU flash.
//
// slot -- offset in settings array in flash.
int readsettings(int slot)
{
	memcpy(&st, (void *) (USER_FLASH + slot),
		sizeof(struct settings));

	return 0;
}

// Init stabilization loop.
//
// alt -- initial quadcopter altitude. Usually 0.0.
int initstabilize(float alt)
{
	// set initial altitude. Usually 0.0
	alt0 = alt;

	// init complementary filters contexts
	dsp_initcompl(&pitchcompl, st.atctcoef, PID_FREQ);
	dsp_initcompl(&rollcompl, st.atctcoef, PID_FREQ);
	dsp_initcompl(&yawcompl, st.yctcoef, PID_FREQ);

	dsp_initcompl(&climbratecompl, st.cctcoef, HP_FREQ);
	dsp_initcompl(&altcompl, st.actcoef, HP_FREQ);

	// init roll and pitch position PID controller contexts
	dsp_initpidval(&pitchpv, st.p, st.i, st.d, 0.0);
	dsp_initpidval(&rollpv, st.p, st.i, st.d, 0.0);

	// init roll, pitch and yaw speed PID controller contexts
	dsp_initpidval(&pitchspv, st.sp, st.si, st.sd, 0.0);
	dsp_initpidval(&rollspv, st.sp, st.si, st.sd, 0.0);
	dsp_initpidval(&yawspv, st.ysp, st.ysi, st.ysd, 0.0);

	// init yaw position PID controller's context
	dsp_initpidval(&yawpv, st.yp, st.yi, st.yd, 0.0);

	// init vertical acceleration PID controller's context
	dsp_initpidval(&tpv, st.zsp, st.zsi, st.zsd, 0.0);

	// init climbrate PID controller's context
	dsp_initpidval(&cpv, st.cp, st.ci, st.cd, 0.0);

	// init altitude PID controller's context
	dsp_initpidval(&apv, st.ap, st.ai, st.ad, 0.0);

	// init low-pass fitlers for altitude and vertical acceleration
	dsp_initlpf(&altlpf, st.atcoef, HP_FREQ);
	dsp_initlpf(&tlpf, st.ttcoef, PID_FREQ);
	dsp_initlpf(&valpf, st.vatcoef, PID_FREQ);

	return 0;
}

// Stabilization loop. Callback for TEV_PID periodic event. It is the
// place where is almost all work happening.
//
// ms -- microsecond passed from last callback invocation.
int stabilize(int ms)
{
	struct icm_data id;
	float ltm, lbm, rbm, rtm;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float vx, vy, vz;
	float gy, gx, gz;
	float dt;

	// get time passed from last invocation of this calback function
	dt = ms / (float) TICKSPERSEC;

	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

	// toggle arming indication led
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6,
		en ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// get accelerometer and gyroscope readings
	dev[ICM_DEV].read(dev[ICM_DEV].priv, &id,
		sizeof(struct icm_data));

	// write accelerometer and gyroscope values into log
	logwrite(LOG_ACC_X, id.afx);
	logwrite(LOG_ACC_Y, id.afy);
	logwrite(LOG_ACC_Z, id.afz);
	logwrite(LOG_GYRO_X, id.gfx);
	logwrite(LOG_GYRO_Y, id.gfy);
	logwrite(LOG_GYRO_Z, id.gfz);

	// apply accelerometer offsets
	id.afx -= st.ax0;
	id.afy -= st.ay0;
	id.afz -= st.az0;

	// update vertical acceleration low-pass filter
	dsp_updatelpf(&tlpf, id.afz);

	// offset gyroscope readings by values, calculater
	// at power on and convert result into radians
	gx = deg2rad((id.gfx - st.gx0));
	gy = deg2rad((id.gfy - st.gy0));
	gz = deg2rad((id.gfz - st.gz0));

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatecompl(&rollcompl, gy * dt,
		atan2f(-id.afx,
		sqrt(id.afy * id.afy + id.afz * id.afz))) - st.roll0;

	// same as for roll but for different axes
	pitch = dsp_updatecompl(&pitchcompl, gx * dt,
		atan2f(id.afy,
		sqrt(id.afx * id.afx + id.afz * id.afz))) - st.pitch0;

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	yaw = circf(dsp_updatecirccompl(&yawcompl, -gz * dt,
		qmc_heading(roll, -pitch,
			qmcdata.fx, qmcdata.fy, qmcdata.fz)) - st.yaw0);

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = cos(-pitch) * sin(-roll);
	vy = -sin(-pitch);
	vz = cos(-pitch) * cos(-roll);

