PinkFluffyUnic0rn/stm32flight/main.c
			data = buf + 4;

			// put all frame's values into a string
			sprintf(data, "%d ", fp + bp);
			
			for (i = 0; i < LOG_PACKSIZE; ++i) {
				sprintf(data + strlen(data), "%0.5f ",
					(double) logbuf[bp].data[i]);
			}

			sprintf(data + strlen(data), "\r\n");

			sprintf(buf, "%03hu",
				crc8((uint8_t *) data, strlen(data)));
			buf[3] = ' ';

			// send this string into debug connection
			d->write(d->priv, buf, strlen(buf));
		}
	}
			
	
	sprintf(buf, "-end-\r\n");
	d->write(d->priv, buf, strlen(buf));

	return 1;
}

// Disarm command handler.
//
// toks -- list of parsed command tokens.
int rcmd(const struct cdevice *dev, const char **toks, char *out)
{
	en = 0.0;
	
	return 0;
}

// Recalibrate command handler.
//
// toks -- list of parsed command tokens.
int ccmd(const struct cdevice *dev, const char **toks, char *out)
{
	initstabilize(atof(toks[1]));

	return 0;
}

// "info" command handler. Print various sensor and control values.
//
// toks -- list of parsed command tokens.
int infocmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "mpu") == 0) {
		struct icm_data id;

		dev[ICM_DEV].read(dev[ICM_DEV].priv, &id,
			sizeof(struct icm_data));

		id.afx -= st.ax0;
		id.afy -= st.ay0;
		id.afz -= st.az0;

		sprintpos(out, &id);
	}
	else if (strcmp(toks[1], "qmc") == 0) {
		struct qmc_data hd;

		dev[QMC_DEV].read(dev[QMC_DEV].priv, &hd,
			sizeof(struct qmc_data));

		sprintqmc(out, &hd);	
	}
	else if (strcmp(toks[1], "hp") == 0) {
		float alt;

		alt = dsp_getlpf(&altlpf) - alt0;

		snprintf(out, INFOLEN,
			"temp: %f; alt: %f; climb rate: %f\r\n",
			(double) temp, (double) alt,
			(double) dsp_getcompl(&climbratecompl));
	}
	else if (strcmp(toks[1], "dev") == 0)
		sprintdevs(out);
	else if (strcmp(toks[1], "values") == 0)
		sprintvalues(out);
	else if (strcmp(toks[1], "pid") == 0)
		sprintpid(out);
	else if (strcmp(toks[1], "gnss") == 0)
		sprintgnss(out);
	else if (strcmp(toks[1], "ctrl") == 0)
		sprintfctrl(out);
	else if (strcmp(toks[1], "filter") == 0)
		sprintffilters(out);
	else
		return (-1);

	return 1;
}

// "pid" command handler. Configure PID values.
//
// toks -- list of parsed command tokens.
int pidcmd(const struct cdevice *dev, const char **toks, char *out)
{
	float v;

	v = atof(toks[3]);

	if (strcmp(toks[1], "tilt") == 0) {
		if (strcmp(toks[2], "mode") == 0) {
			if (strcmp(toks[3], "double") == 0)
				st.speedpid = 0;
			else if (strcmp(toks[3], "single") == 0)
				st.speedpid = 1;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "p") == 0)	st.p = v;
		else if (strcmp(toks[2], "i") == 0)	st.i = v;
		else if (strcmp(toks[2], "d") == 0)	st.d = v;
		else					return (-1);

		dsp_setpid(&pitchpv, st.p, st.i, st.d);
		dsp_setpid(&rollpv, st.p, st.i, st.d);
	}
	else if (strcmp(toks[1], "stilt") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.sp = v;
		else if (strcmp(toks[2], "i") == 0)	st.si = v;
		else if (strcmp(toks[2], "d") == 0)	st.sd = v;
		else					return (-1);

		dsp_setpid(&pitchspv, st.sp, st.si, st.sd);
		dsp_setpid(&rollspv, st.sp, st.si, st.sd);
	}
	else if (strcmp(toks[1], "yaw") == 0) {
		if (strcmp(toks[2], "mode") == 0) {
			if (strcmp(toks[3], "double") == 0)
				st.yawspeedpid = 0;
			else if (strcmp(toks[3], "single") == 0)
				st.yawspeedpid = 1;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "p") == 0)	st.yp = v;
		else if (strcmp(toks[2], "i") == 0)	st.yi = v;
		else if (strcmp(toks[2], "d") == 0)	st.yd = v;
		else					return (-1);

		dsp_setpid(&yawpv, st.yp, st.yi, st.yd);
	}
	else if (strcmp(toks[1], "syaw") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.ysp = v;
		else if (strcmp(toks[2], "i") == 0)	st.ysi = v;
		else if (strcmp(toks[2], "d") == 0)	st.ysd = v;
		else					return (-1);

		dsp_setpid(&yawspv, st.ysp, st.ysi, st.ysd);
	}
	else if (strcmp(toks[1], "throttle") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.zsp = v;
		else if (strcmp(toks[2], "i") == 0)	st.zsi = v;
		else if (strcmp(toks[2], "d") == 0)	st.zsd = v;
		else					return (-1);

		dsp_setpid(&tpv, st.zsp, st.zsi, st.zsd);
	}
	else if (strcmp(toks[1], "climbrate") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.cp = v;
		else if (strcmp(toks[2], "i") == 0)	st.ci = v;
		else if (strcmp(toks[2], "d") == 0)	st.cd = v;
		else					return (-1);

		dsp_setpid(&cpv, st.cp, st.ci, st.cd);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		if (strcmp(toks[2], "p") == 0)		st.ap = v;
		else if (strcmp(toks[2], "i") == 0)	st.ai = v;
		else if (strcmp(toks[2], "d") == 0)	st.ad = v;
		else					return (-1);

		dsp_setpid(&apv, st.ap, st.ai, st.ad);
	}
	else
		return (-1);
	
	return 0;
}

// "calib" command handler. Turn on/off devices calibration modes.
//
// toks -- list of parsed command tokens.
int calibcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "mag") == 0) {
		if (strcmp(toks[2], "on") == 0)
			magcalibmode = 1;
		else if (strcmp(toks[2], "off") == 0)
			magcalibmode = 0;
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

// "flash" command handler. Write/read MCU's internal flash
// used for storing configuraton.
//
// toks -- list of parsed command tokens.
int flashcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "write") == 0)
		writesettings(atoi(toks[2]));	
	else if (strcmp(toks[1], "read") == 0)
		readsettings(atoi(toks[2]));
	else
		return (-1);
	
	return 0;
}

// "compl" command handler. Configure pitch/roll complimentary filters.
//
// toks -- list of parsed command tokens.
int complcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "attitude") == 0) {
		st.atctcoef = atof(toks[2]);
		dsp_initcompl(&rollcompl, st.atctcoef, PID_FREQ);	
		dsp_initcompl(&pitchcompl, st.atctcoef, PID_FREQ);
	}
	else if (strcmp(toks[1], "yaw") == 0) {
		st.yctcoef = atof(toks[2]);
		dsp_initcompl(&yawcompl, st.yctcoef, PID_FREQ);	
	}
	else if (strcmp(toks[1], "climbrate") == 0) {
		st.cctcoef = atof(toks[2]);
		dsp_initcompl(&climbratecompl, st.cctcoef, HP_FREQ);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		st.actcoef = atof(toks[2]);
		dsp_initcompl(&altcompl, st.actcoef, HP_FREQ);
	}

