PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

// "lpf" command handler. Configure low-pass filters.
//
// toks -- list of parsed command tokens.
int lpfcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "climb") == 0) {
		st.ttcoef = atof(toks[2]);

		dsp_initlpf(&tlpf, st.ttcoef, PID_FREQ);
	}
	else if (strcmp(toks[1], "vaccel") == 0) {
		st.vatcoef = atof(toks[2]);

		dsp_initlpf(&valpf, st.vatcoef, PID_FREQ);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		st.atcoef = atof(toks[2]);

		dsp_initlpf(&altlpf, st.atcoef, HP_FREQ);
	}
	else
		return (-1);

	return 0;
}

// "adj" command handler. Configure various offset/scale values.
//
// toks -- list of parsed command tokens.
int adjcmd(const struct cdevice *dev, const char **toks, char *out)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "rollthrust") == 0)		st.rsc = v;
	else if (strcmp(toks[1], "pitchthrust") == 0)	st.psc = v;
	else if (strcmp(toks[1], "roll") == 0)		st.roll0 = v;
	else if (strcmp(toks[1], "pitch") == 0)		st.pitch0 = v;
	else if (strcmp(toks[1], "yaw") == 0)		st.yaw0 = v;
	else if (strcmp(toks[1], "acc") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.ax0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.ay0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.az0 = atof(toks[3]);
	}
	else if (strcmp(toks[1], "gyro") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.gx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.gy0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.gz0 = atof(toks[3]);
	}
	else if (strcmp(toks[1], "mag") == 0) {
		if (strcmp(toks[2], "x0") == 0)
			st.mx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y0") == 0)
			st.my0 = atof(toks[3]);
		else if (strcmp(toks[2], "z0") == 0)
			st.mz0 = atof(toks[3]);
		else if (strcmp(toks[2], "xscale") == 0)
			st.mxsc = atof(toks[3]);
		else if (strcmp(toks[2], "yscale") == 0)
			st.mysc = atof(toks[3]);
		else if (strcmp(toks[2], "zscale") == 0)
			st.mzsc = atof(toks[3]);
		else if (strcmp(toks[2], "decl") == 0)
			st.magdecl = atof(toks[3]);
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

// "log" command handler. Start/stop/get flight log.
//
// toks -- list of parsed command tokens.
int logcmd(const struct cdevice *d, const char **toks, char *out)
{
	char s[INFOLEN];
	
	if (strcmp(toks[1], "set") == 0) {
		// flash erasing process takes time and blocks
		// other actions, so disarm for safety
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

		// notify user when erasing is started
		sprintf(s, "erasing flash...\r\n");
		d->write(d->priv, s, strlen(s));

		// set log size (0 is valid and
		// means to disable logging)
		if (atoi(toks[2]) > W25_TOTALSIZE)
			return (-1);

		logsize = atoi(toks[2]) * sizeof(struct logpack);

		// erase log flash no
		// respond during this process
		eraseflash(d, logsize);

		// notify user when telemetry flash is erased
		sprintf(s,"erased %u bytes of flash\r\n", logsize);
		d->write(d->priv, s, strlen(s));

		// enable telemetry
		logtotal = 0;
		logflashpos = 0;
		logbufpos = 0;
	}
	else if (strcmp(toks[1], "get") == 0)
		return printlog(d, s, atoi(toks[2]), atoi(toks[3]));
	else
		return (-1);

	return 0;
}


// "ctrl" command handler. Configure control ranges scaling.
//
// toks -- list of parsed command tokens.
int ctrlcmd(const struct cdevice *d, const char **toks, char *out)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "roll") == 0)
		st.rollmax = v;
	else if (strcmp(toks[1], "pitch") == 0)
		st.pitchmax = v;
	else if (strcmp(toks[1], "syaw") == 0)
		st.yawspeed = v;
	else if (strcmp(toks[1], "yaw") == 0)
		st.yawtargetspeed = v;
	else if (strcmp(toks[1], "accel") == 0)	
		st.accelmax = v;
	else if (strcmp(toks[1], "climbrate") == 0)
		st.climbratemax = v;
	else if (strcmp(toks[1], "altmax") == 0)
		st.altmax = v;
	else
		return (-1);

	return 0;
}

// "system" command handler. Run system commands.
//
// toks -- list of parsed command tokens.
int systemcmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "esp") == 0) {
		if (strcmp(toks[2], "flash") == 0)
			dev[ESP_DEV].configure(dev[ESP_DEV].priv, "flash");
		else if (strcmp(toks[2], "run") == 0)
			dev[ESP_DEV].configure(dev[ESP_DEV].priv, "run");
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

// Parse and execute control command got from debug wifi-connection.
//
// cmd -- command to be executed.
int runcommand(const struct cdevice *d, char *cmd)
{
	char buf[ESP_CMDSIZE];
	char out[INFOLEN];
	char *toks[MAX_CMDTOKS];
	uint8_t crc;
	int toksoff;
	int i;
	
	if (cmd[0] == '\0')
		return 0;

	memcpy(buf, cmd, ESP_CMDSIZE);

	// split a command into tokens by spaces
	parsecommand(toks, MAX_CMDTOKS, buf);

	toksoff = 0;

	if (d == dev + ESP_DEV) {
		toksoff = 1;

		crc = crc8((uint8_t *) cmd + 4, strlen(cmd) - 4);

		if (atoi(toks[0]) != crc)
			goto crcfail;
	}

	// perform corresponding action
	for (i = 0; i < commcount; ++i) {
		if (strcmp(toks[toksoff], commtable[i].name) == 0) {
			int r;
		
			out[0] = '\0';

			if ((r = commtable[i].func(d,
					(const char **) toks + toksoff,
					out)) < 0)
				goto unknown;

			// r > 0, then it's a printing command and
			// it does not transmission confirm
			if (r == 0) {
				char hdr[ESP_CMDSIZE];

				memcpy(hdr, cmd, ESP_CMDSIZE);
				d->write(d->priv, hdr, strlen(hdr));
			}

			if (strlen(out) != 0)
				d->write(d->priv, out, strlen(out));

			return 0;
		}
	}

	return 0;

unknown:
	snprintf(out, INFOLEN, "Unknown command: %s\r\n", cmd + 4);
	d->write(d->priv, out, strlen(out));

	return (-1);

crcfail:
	snprintf(out, INFOLEN, "CRC check fail, got %hu: %s\r\n", crc,
		cmd + 4);

	d->write(d->priv, out, strlen(out));

	return (-1);
}

// Set control values using CRSF packet.
//
// cd -- CRSF packet
// ms -- microsecond passed from last CRSF packet
int crsfcmd(const struct crsf_data *cd, int ms)
{
	float dt;

	// channel to on remote is used to turn on/off
	// erls control. If this channel has low state, all remote
	// commands will be ignored, but packet still continue to
	// comming
	elrs = (cd->chf[7] > 0.5) ? 1 : 0;

	// update ERLS timeout as we got packet
	elrstimeout = ELRS_TIMEOUT;

	if (!elrs) {
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

